# Pandas - Group by

In [1]:
import pandas as pd

In [18]:
dict = {'A' : [1, 2, 3, 4, 5], 'B': ['a', 'a', 'c', 'd', 'd'], 'NUM': [100, 100, None, 400, 500 ]}
df1 = pd.DataFrame(dict)
df1

   A  B    NUM
0  1  a  100.0
1  2  a  100.0
2  3  c    NaN
3  4  d  400.0
4  5  d  500.0

In [21]:
df1_group = df1.groupby(['B'])
df1_group

### Count()

In [22]:
# count() - returns number of non empty rows for all remaining column groupped by given column, here 'B'
df2 = df1.groupby(['B']).count()
df2

   A  NUM
B
a  2    2
c  1    0
d  2    2

In [28]:
# count() - returns number of non empty rows for specified column ('A') groupped by given column, here 'B'
df2 = df1.groupby(['B'])['A'].count()
df2

B
a    2
c    1
d    2
Name: A, dtype: int64

In [29]:
# resetting index = creates a normal dataframe from the group by, hence the visible column name ('A')
df2 = df1.groupby(['B'])['A'].count().reset_index()
df2

   B  A
0  a  2
1  c  1
2  d  2

### Size()

In [27]:
# size() returns number of all records groupped by give column including NaN's
df2 = df1.groupby(['B']).size()
df2

B
a    2
c    1
d    2
dtype: int64

In [26]:
df2 = df1.groupby(['B'])['NUM'].count()
df2

B
a    2
c    0
d    2
Name: NUM, dtype: int64

### Agg()

In [37]:
df2 = df1.groupby(['B']).agg({'NUM':sum})
df2

     NUM
B
a  200.0
c    0.0
d  900.0

### Count Null Values & Aggregate

In [35]:
df1.isnull()

       A      B    NUM
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False
4  False  False  False

In [36]:
df1.isna()

       A      B    NUM
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False
4  False  False  False